#### DynamoDB Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.infra: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.orders will be created
  + resource "aws_dynamodb_table" "orders" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "tech-challenge-orders"
      + read_capacity    = (known after apply)
      + region           = "us-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "tech-challenge-orders"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-orders"
          + "Project"     = "TechChallenge"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "N"
        }
      + attribute {
          + name = "status"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "status"
          + name               = "status-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)

          + warm_throughput (known after apply)
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # aws_dynamodb_table.payments will be created
  + resource "aws_dynamodb_table" "payments" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "tech-challenge-payments"
      + read_capacity    = (known after apply)
      + region           = "us-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "tech-challenge-payments"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-payments"
          + "Project"     = "TechChallenge"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # aws_iam_policy.dynamodb_access will be created
  + resource "aws_iam_policy" "dynamodb_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for accessing DynamoDB tables"
      + id               = (known after apply)
      + name             = "tech-challenge-dynamodb-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "TechChallenge"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_region                   = "us-east-1"
  + dynamodb_access_policy_arn   = (known after apply)
  + dynamodb_payments_table_arn  = (known after apply)
  + dynamodb_payments_table_name = "tech-challenge-payments"
  + dynamodb_table_arn           = (known after apply)
  + dynamodb_table_name          = "tech-challenge-orders"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @TheMyFish, Action: `pull_request`*